SpenceKonde/DxCore/megaavr/variants/64pin-standard/pins_arduino.h
#define PIN_SPI_MOSI_PINSWAP_1         (PIN_PE0)
#define PIN_SPI_MISO_PINSWAP_1         (PIN_PE1)
#define PIN_SPI_SCK_PINSWAP_1          (PIN_PE2)
#define PIN_SPI_SS_PINSWAP_1           (PIN_PE3)

#define PIN_SPI_MOSI_PINSWAP_2         (PIN_PG4)
#define PIN_SPI_MISO_PINSWAP_2         (PIN_PG5)
#define PIN_SPI_SCK_PINSWAP_2          (PIN_PG6)
#define PIN_SPI_SS_PINSWAP_2           (PIN_PG7)

// SPI 1
#define SPI1_MUX                        (0x00)
#define SPI1_MUX_PINSWAP_1              (0x01)
#define SPI1_MUX_PINSWAP_2              (0x02)
#define SPI1_MUX_PINSWAP_NONE           (PORTMUX_SPI0_NONE_gc)
#define PIN_SPI1_MOSI                   (PIN_PC0)
#define PIN_SPI1_MISO                   (PIN_PC1)
#define PIN_SPI1_SCK                    (PIN_PC2)
#define PIN_SPI1_SS                     (PIN_PC3)

#define PIN_SPI1_MOSI_PINSWAP_1         (PIN_PC4)
#define PIN_SPI1_MISO_PINSWAP_1         (PIN_PC5)
#define PIN_SPI1_SCK_PINSWAP_1          (PIN_PC6)
#define PIN_SPI1_SS_PINSWAP_1           (PIN_PC7)

#define PIN_SPI1_MOSI_PINSWAP_2         (PIN_PB4)
#define PIN_SPI1_MISO_PINSWAP_2         (PIN_PB5)
#define PIN_SPI1_SCK_PINSWAP_2          (PIN_PB6)
#define PIN_SPI1_SS_PINSWAP_2           (PIN_PB7)

// TWI 0
#define PIN_WIRE_SDA                   (PIN_PA2)
#define PIN_WIRE_SCL                   (PIN_PA3)
#define PIN_WIRE_SDA_PINSWAP_1         (PIN_PC2)
#define PIN_WIRE_SCL_PINSWAP_1         (PIN_PC3)
#define PIN_WIRE_SDA_PINSWAP_2         (PIN_PC2)
#define PIN_WIRE_SCL_PINSWAP_2         (PIN_PC3)


// TWI 1
#define PIN_WIRE1_SDA                   (PIN_PF2)
#define PIN_WIRE1_SCL                   (PIN_PF3)
#define PIN_WIRE1_SDA_PINSWAP_2         (PIN_PB2)
#define PIN_WIRE1_SCL_PINSWAP_2         (PIN_PB3)

// USART 0
#define HWSERIAL0_MUX                   (0x00 /* PORTMUX_USART0_DEFAULT_gc */  /* Nope, redundant */)
#define HWSERIAL0_MUX_PINSWAP_1         (0x01 /* PORTMUX_USART0_ALT1_gc */)
#define HWSERIAL0_MUX_PINSWAP_NONE      (0x03 << 0)
#define PIN_HWSERIAL0_TX                (PIN_PA0 /* All the pins stay */)
#define PIN_HWSERIAL0_RX                (PIN_PA1)
#define PIN_HWSERIAL0_XCK               (PIN_PA2)
#define PIN_HWSERIAL0_XDIR              (PIN_PA3)
#define PIN_HWSERIAL0_TX_PINSWAP_1      (PIN_PA4)
#define PIN_HWSERIAL0_RX_PINSWAP_1      (PIN_PA5)
#define PIN_HWSERIAL0_XCK_PINSWAP_1     (PIN_PA6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_1    (PIN_PA7)

// USART1
#define HWSERIAL1_MUX                   (0x00 /* PORTMUX_USART1_DEFAULT_gc */)
#define HWSERIAL1_MUX_PINSWAP_1         (0x01 << 1)
#define HWSERIAL1_MUX_PINSWAP_NONE      (0x03 << 2)
#define PIN_HWSERIAL1_TX                (PIN_PC0)
#define PIN_HWSERIAL1_RX                (PIN_PC1)
#define PIN_HWSERIAL1_XCK               (PIN_PC2)
#define PIN_HWSERIAL1_XDIR              (PIN_PC3)
#define PIN_HWSERIAL1_TX_PINSWAP_1      (PIN_PC4)
#define PIN_HWSERIAL1_RX_PINSWAP_1      (PIN_PC5)
#define PIN_HWSERIAL1_XCK_PINSWAP_1     (PIN_PC6)
#define PIN_HWSERIAL1_XDIR_PINSWAP_1    (PIN_PC7)

// USART 2
#define HWSERIAL2_MUX                   (0x00 /* PORTMUX_USART2_DEFAULT_gc */)
#define HWSERIAL2_MUX_PINSWAP_1         (0x01 << 4 /* PORTMUX_USART2_ALT1_gc */)
#define HWSERIAL2_MUX_PINSWAP_NONE      (0x03 << 4)
#define PIN_HWSERIAL2_TX                (PIN_PF0)
#define PIN_HWSERIAL2_RX                (PIN_PF1)
#define PIN_HWSERIAL2_XCK               (PIN_PF2)
#define PIN_HWSERIAL2_XDIR              (PIN_PF3)
#define PIN_HWSERIAL2_TX_PINSWAP_1      (PIN_PF4)
#define PIN_HWSERIAL2_RX_PINSWAP_1      (PIN_PF5)
#define PIN_HWSERIAL2_XCK_PINSWAP_1     (NOT_A_PIN)
#define PIN_HWSERIAL2_XDIR_PINSWAP_1    (NOT_A_PIN)

// USART 3
#define HWSERIAL3_MUX                   (0x00 /* PORTMUX_USART3_DEFAULT_gc */)
#define HWSERIAL3_MUX_PINSWAP_1         (0x01 << 6)
#define HWSERIAL3_MUX_PINSWAP_NONE      (0x03 << 6/* PORTMUX_USART3_NONE_gc */)
#define PIN_HWSERIAL3_TX                (PIN_PB0)
#define PIN_HWSERIAL3_RX                (PIN_PB1)
#define PIN_HWSERIAL3_XCK               (PIN_PB2)
#define PIN_HWSERIAL3_XDIR              (PIN_PB3)
#define PIN_HWSERIAL3_TX_PINSWAP_1      (PIN_PB4)
#define PIN_HWSERIAL3_RX_PINSWAP_1      (PIN_PB5)
#define PIN_HWSERIAL3_XCK_PINSWAP_1     (PIN_PB6)
#define PIN_HWSERIAL3_XDIR_PINSWAP_1    (PIN_PB7)

// USART 4
#define HWSERIAL4_MUX                   (0x00 /* PORTMUX_USART4_DEFAULT_gc */)
#define HWSERIAL4_MUX_PINSWAP_1         (0x01 << 1)
#define HWSERIAL4_MUX_PINSWAP_NONE      (0x03 << 0 /* PORTMUX_USART4_NONE_gc */)
#define PIN_HWSERIAL4_TX                (PIN_PE0)
#define PIN_HWSERIAL4_RX                (PIN_PE1)
#define PIN_HWSERIAL4_XCK               (PIN_PE2)
#define PIN_HWSERIAL4_XDIR              (PIN_PE3)
#define PIN_HWSERIAL4_TX_PINSWAP_1      (PIN_PE4)
#define PIN_HWSERIAL4_RX_PINSWAP_1      (PIN_PE5)
#define PIN_HWSERIAL4_XCK_PINSWAP_1     (PIN_PE6)
#define PIN_HWSERIAL4_XDIR_PINSWAP_1    (PIN_PE7)

// USART 5
#define HWSERIAL5_MUX                   (0x00 /* PORTMUX_USART5_DEFAULT_gc */)
#define HWSERIAL5_MUX_PINSWAP_1         (0x01 << 2 /* PORTMUX_USART5_ALT1_gc */)
#define HWSERIAL5_MUX_PINSWAP_NONE      (0x03 << 2 /* PORTMUX_USART5_NONE_gc */)
#define PIN_HWSERIAL5_TX                (PIN_PG0)
#define PIN_HWSERIAL5_RX                (PIN_PG1)
#define PIN_HWSERIAL5_XCK               (PIN_PG2)
#define PIN_HWSERIAL5_XDIR              (PIN_PG3)
#define PIN_HWSERIAL5_TX_PINSWAP_1      (PIN_PG4)
#define PIN_HWSERIAL5_RX_PINSWAP_1      (PIN_PG5)
#define PIN_HWSERIAL5_XCK_PINSWAP_1     (PIN_PG6)
#define PIN_HWSERIAL5_XDIR_PINSWAP_1    (PIN_PG7)

        /*##  #   #  ###  #     ###   ###      ####  ### #   #  ###
        #   # ##  # #   # #    #   # #         #   #  #  ##  # #
        ##### # # # ##### #    #   # #  ##     ####   #  # # #  ###
        #   # #  ## #   # #    #   # #   #     #      #  #  ##     #
        #   # #   # #   # ####  ###   ###      #     ### #   #  #*/

#define PIN_A0           (PIN_PD0)
#define PIN_A1           (PIN_PD1)
#define PIN_A2           (PIN_PD2)
#define PIN_A3           (PIN_PD3)
#define PIN_A4           (PIN_PD4)
#define PIN_A5           (PIN_PD5)
#define PIN_A6           (PIN_PD6)
#define PIN_A7           (PIN_PD7)
#define PIN_A8           (PIN_PE0)
#define PIN_A9           (PIN_PE1)
#define PIN_A10          (PIN_PE2)
#define PIN_A11          (PIN_PE3)
#define PIN_A12          (PIN_PE4)
#define PIN_A13          (PIN_PE5)
#define PIN_A14          (PIN_PE6)
#define PIN_A15          (PIN_PE7)
#define PIN_A16          (PIN_PF0)
#define PIN_A17          (PIN_PF1)
#define PIN_A18          (PIN_PF2)
#define PIN_A19          (PIN_PF3)
#define PIN_A20          (PIN_PF4)
#define PIN_A21          (PIN_PF5)
static const uint8_t A0  = PIN_A0;
static const uint8_t A1  = PIN_A1;
static const uint8_t A2  = PIN_A2;
static const uint8_t A3  = PIN_A3;
static const uint8_t A4  = PIN_A4;
static const uint8_t A5  = PIN_A5;
static const uint8_t A6  = PIN_A6;
static const uint8_t A7  = PIN_A7;
static const uint8_t A8  = PIN_A8;
static const uint8_t A9  = PIN_A9;
static const uint8_t A10 = PIN_A10;
static const uint8_t A11 = PIN_A11;
static const uint8_t A12 = PIN_A12;
static const uint8_t A13 = PIN_A13;
static const uint8_t A14 = PIN_A14;
static const uint8_t A15 = PIN_A15;
static const uint8_t A16 = PIN_A16;
static const uint8_t A17 = PIN_A17;
static const uint8_t A18 = PIN_A18;
static const uint8_t A19 = PIN_A19;
static const uint8_t A20 = PIN_A20;
static const uint8_t A21 = PIN_A21;
#define  AIN0            ADC_CH(0)
#define  AIN1            ADC_CH(1)
#define  AIN2            ADC_CH(2)
#define  AIN3            ADC_CH(3)
#define  AIN4            ADC_CH(4)
#define  AIN5            ADC_CH(5)
#define  AIN6            ADC_CH(6)
#define  AIN7            ADC_CH(7)
#define  AIN8            ADC_CH(8)
#define  AIN9            ADC_CH(9)
#define AIN10           ADC_CH(10)
#define AIN11           ADC_CH(11)
#define AIN12           ADC_CH(12)
#define AIN13           ADC_CH(13)
#define AIN14           ADC_CH(14)
#define AIN15           ADC_CH(15)
#define AIN16           ADC_CH(16)
#define AIN17           ADC_CH(17)
#define AIN18           ADC_CH(18)
#define AIN19           ADC_CH(19)
#define AIN20           ADC_CH(20)
#define AIN21           ADC_CH(21)

        /*##  ### #   #      ###  ####  ####   ###  #   #  ###
        #   #  #  ##  #     #   # #   # #   # #   #  # #  #
        ####   #  # # #     ##### ####  ####  #####   #    ###
        #      #  #  ##     #   # #  #  #  #  #   #   #       #
        #     ### #   #     #   # #   # #   # #   #   #    #*/

#ifdef ARDUINO_MAIN
/* this guards against multiple definition errors, since this file gets included by everything,
 * but only in one case should these tables be generated */
const uint8_t digital_pin_to_port[] = {
  PA,  //   0 PA0/XTAL0/CLKIN   (Note that it's not a pin when using external clock, and bitmask and position will come back as NOT_A_PIN)
  PA,  //   1 PA1/XTAL1 (If using a crystal, same as above.)
  PA,  //   2 PA2
  PA,  //   3 PA3
  PA,  //   4 PA4
  PA,  //   5 PA5
  PA,  //   6 PA6
  PA,  //   7 PA7
  PB,  //   8 PB0
  PB,  //   9 PB1
  PB,  //  10 PB2
  PB,  //  11 PB3
  PB,  //  12 PB4
  PB,  //  13 PB5
  PB,  //  14 PB6
  PB,  //  15 PB7
  PC,  //  16 PC0
  PC,  //  17 PC1
  PC,  //  18 PC2
  PC,  //  19 PC3
  PC,  //  20 PC4
  PC,  //  21 PC5
  PC,  //  22 PC6
  PC,  //  23 PC7
  PD,  //  24 PD0
  PD,  //  25 PD1
  PD,  //  26 PD2
  PD,  //  27 PD3
  PD,  //  28 PD4
  PD,  //  29 PD5
  PD,  //  30 PD6
  PD,  //  31 PD7
  PE,  //  32 PE0
  PE,  //  33 PE1
  PE,  //  34 PE2
  PE,  //  35 PE3
  PE,  //  36 PE4
  PE,  //  37 PE5
  PE,  //  38 PE6
  PE,  //  39 PE7
  PF,  //  40 PF0
  PF,  //  41 PF1
  PF,  //  42 PF2
  PF,  //  43 PF3
  PF,  //  44 PF4
  PF,  //  45 PF5
  PG,  //  46 PG0
  PG,  //  47 PG1
  PG,  //  48 PG2
  PG,  //  49 PG3
  PG,  //  50 PG4
  PG,  //  51 PG5
  PG,  //  52 PG6
  PG,  //  53 PG7
  PF,  //  54 PF6
  //PF,//  55 PF7 (UPDI)
};

