SpenceKonde/DxCore/megaavr/variants/64pin-standard/pins_arduino.h
/* Use this for accessing PINnCTRL register */
const uint8_t digital_pin_to_bit_position[] = { // *INDENT-OFF*
  #if ((CLOCK_SOURCE & 0x03) == 0) // PA0 used for external clock and crystal.
    PIN0_bp,//   0 PA0
  #else
    NOT_A_PIN,
  #endif
  #if ((CLOCK_SOURCE & 0x03) == 1)   // PA1 also used for crystal
    NOT_A_PIN,
  #else // PA1 used for external crystal.
    PIN1_bp,//   1 PA1
  #endif    // *INDENT-ON*
  PIN2_bp,  //   2 PA2
  PIN3_bp,  //   3 PA3
  PIN4_bp,  //   4 PA4
  PIN5_bp,  //   5 PA5
  PIN6_bp,  //   6 PA6
  PIN7_bp,  //   7 PA7
  PIN0_bp,  //   8 PB0
  PIN1_bp,  //   9 PB1
  PIN2_bp,  //  10 PB2
  PIN3_bp,  //  11 PB3
  PIN4_bp,  //  12 PB4
  PIN5_bp,  //  13 PB5
  PIN6_bp,  //  14 PB6
  PIN7_bp,  //  15 PB7
  PIN0_bp,  //  16 PC0
  PIN1_bp,  //  17 PC1
  PIN2_bp,  //  18 PC2
  PIN3_bp,  //  19 PC3
  PIN4_bp,  //  20 PC4
  PIN5_bp,  //  21 PC5
  PIN6_bp,  //  22 PC6
  PIN7_bp,  //  23 PC7
  PIN0_bp,  //  24 PD0
  PIN1_bp,  //  25 PD1
  PIN2_bp,  //  26 PD2
  PIN3_bp,  //  27 PD3
  PIN4_bp,  //  28 PD4
  PIN5_bp,  //  29 PD5
  PIN6_bp,  //  30 PD6
  PIN7_bp,  //  31 PD7
  PIN0_bp,  //  32 PE0
  PIN1_bp,  //  33 PE1
  PIN2_bp,  //  34 PE2
  PIN3_bp,  //  35 PE3
  PIN4_bp,  //  36 PE4
  PIN5_bp,  //  37 PE5
  PIN6_bp,  //  38 PE6
  PIN7_bp,  //  39 PE7
  PIN0_bp,  //  40 PF0
  PIN1_bp,  //  41 PF1
  PIN2_bp,  //  42 PF2
  PIN3_bp,  //  43 PF3
  PIN4_bp,  //  44 PF4
  PIN5_bp,  //  45 PF5
  PIN0_bp,  //  46 PG0
  PIN1_bp,  //  47 PG1
  PIN2_bp,  //  48 PG2
  PIN3_bp,  //  49 PG3
  PIN4_bp,  //  50 PG4
  PIN5_bp,  //  51 PG5
  PIN6_bp,  //  52 PG6
  PIN7_bp,  //  53 PG7
  PIN6_bp,  //  54 PF6
  //PIN7_bp,//  55 PF7 (UPDI)
};

const uint8_t digital_pin_to_bit_mask[] = { // *INDENT-OFF*
  #if ((CLOCK_SOURCE & 0x03) == 0) // PA0 used for external clock and crystal.
    PIN0_bm,//   0 PA0
  #else
    NOT_A_PIN,
  #endif
  #if ((CLOCK_SOURCE & 0x03) == 1)   // PA1 also used for crystal
    NOT_A_PIN,
  #else // PA1 used for external crystal.
    PIN1_bm,//   1 PA1
  #endif    // *INDENT-ON*
  PIN2_bm,  //   2 PA2
  PIN3_bm,  //   3 PA3
  PIN4_bm,  //   4 PA4
  PIN5_bm,  //   5 PA5
  PIN6_bm,  //   6 PA6
  PIN7_bm,  //   7 PA7
  PIN0_bm,  //   8 PB0
  PIN1_bm,  //   9 PB1
  PIN2_bm,  //  10 PB2
  PIN3_bm,  //  11 PB3
  PIN4_bm,  //  12 PB4
  PIN5_bm,  //  13 PB5
  PIN6_bm,  //  14 PB6
  PIN7_bm,  //  15 PB7
  PIN0_bm,  //  16 PC0
  PIN1_bm,  //  17 PC1
  PIN2_bm,  //  18 PC2
  PIN3_bm,  //  19 PC3
  PIN4_bm,  //  20 PC4
  PIN5_bm,  //  21 PC5
  PIN6_bm,  //  22 PC6
  PIN7_bm,  //  23 PC7
  PIN0_bm,  //  24 PD0
  PIN1_bm,  //  25 PD1
  PIN2_bm,  //  26 PD2
  PIN3_bm,  //  27 PD3
  PIN4_bm,  //  28 PD4
  PIN5_bm,  //  29 PD5
  PIN6_bm,  //  30 PD6
  PIN7_bm,  //  31 PD7
  PIN0_bm,  //  32 PE0
  PIN1_bm,  //  33 PE1
  PIN2_bm,  //  34 PE2
  PIN3_bm,  //  35 PE3
  PIN4_bm,  //  36 PE4
  PIN5_bm,  //  37 PE5
  PIN6_bm,  //  38 PE6
  PIN7_bm,  //  39 PE7
  PIN0_bm,  //  40 PF0
  PIN1_bm,  //  41 PF1
  PIN2_bm,  //  42 PF2
  PIN3_bm,  //  43 PF3
  PIN4_bm,  //  44 PF4
  PIN5_bm,  //  45 PF5
  PIN0_bm,  //  46 PG0
  PIN1_bm,  //  47 PG1
  PIN2_bm,  //  48 PG2
  PIN3_bm,  //  49 PG3
  PIN4_bm,  //  50 PG4
  PIN5_bm,  //  51 PG5
  PIN6_bm,  //  52 PG6
  PIN7_bm,  //  53 PG7
  PIN6_bm,  //  54 PF6
  //PIN7_bm,//  55 PF7 (UPDI)
};
/* This only covers type B and type D */
const uint8_t digital_pin_to_timer[] = {
  NOT_ON_TIMER, //   0 PA0
  NOT_ON_TIMER, //   1 PA1
  NOT_ON_TIMER, //   2 PA2
  NOT_ON_TIMER, //   3 PA3
  TIMERD0_0WOA, //   4 PA4/MOSI      WOA
  TIMERD0_0WOB, //   5 PA5/MISO      WOB
  TIMERD0_0WOC, //   6 PA6/SCK       WOC mirrors WOA
  TIMERD0_0WOD, //   7 PA7/SS/CLKOUT WOD mirrors WOB
  NOT_ON_TIMER, //   8 PB0
  NOT_ON_TIMER, //   9 PB1
  NOT_ON_TIMER, //  10 PB2
  NOT_ON_TIMER, //  11 PB3
  TIMERD0_1WOA, //  12 PB4
  TIMERD0_1WOB, //  13 PB5
  TIMERD0_1WOC, //  14 PB6
  TIMERD0_1WOD, //  15 PB7
  TIMERB2,      //  16 PC0
  TIMERB3,      //  17 PC1
  NOT_ON_TIMER, //  18 PC2
  NOT_ON_TIMER, //  19 PC3
  NOT_ON_TIMER, //  20 PC4
  NOT_ON_TIMER, //  21 PC5
  NOT_ON_TIMER, //  22 PC6
  NOT_ON_TIMER, //  23 PC7
  NOT_ON_TIMER, //  24 PD0
  NOT_ON_TIMER, //  25 PD1
  NOT_ON_TIMER, //  26 PD2
  NOT_ON_TIMER, //  27 PD3
  NOT_ON_TIMER, //  28 PD4
  NOT_ON_TIMER, //  29 PD5
  DACOUT,       //  30 PD6
  NOT_ON_TIMER, //  31 PD7
  NOT_ON_TIMER, //  32 PE0
  NOT_ON_TIMER, //  33 PE1
  NOT_ON_TIMER, //  34 PE2
  NOT_ON_TIMER, //  35 PE3
  NOT_ON_TIMER, //  36 PE4
  NOT_ON_TIMER, //  37 PE5
  NOT_ON_TIMER, //  38 PE6
  NOT_ON_TIMER, //  39 PE7
  TIMERD0_2WOA, //  40 PF0 (TOSC1)
  TIMERD0_2WOB, //  41 PF1 (TOSC2)
  TIMERD0_2WOC, //  42 PF2
  TIMERD0_2WOD, //  43 PF3
  TIMERB0,      //  44 PF4
  TIMERB1,      //  45 PF5
  NOT_ON_TIMER, //  46 PG0
  NOT_ON_TIMER, //  47 PG1
  NOT_ON_TIMER, //  48 PG2
  TIMERB4,      //  49 PG3
  TIMERD0_3WOA, //  50 PG4
  TIMERD0_3WOB, //  51 PG5
  TIMERD0_3WOC, //  52 PG6
  TIMERD0_3WOD, //  53 PG7
  NOT_ON_TIMER, //  54 PF6 (RESET)
  //NOT_ON_TIMER, //55 PF7 (UPDI)
};
#endif
  // These are used for CI testing. They should *not* *ever* be used except for CI-testing where we need to pick a viable pin to compile a sketch with that won't generate compile errors (we don't care whether it would;d actually work, we are concerned with )
  #if ((CLOCK_SOURCE & 0x03) == 0)
    #define _VALID_DIGITAL_PIN(pin)  ((pin) >= && (pin) < 4 ? ((pin) + 2)
  #else
    #define _VALID_DIGITAL_PIN(pin)  ((pin) >= && (pin) < 4 ? ((pin) + 0 ): NOT_A_PIN)
  #endif
  #define    _VALID_ANALOG_PIN(pin)  ((pin) >= 0 && ((pin) <= 4) ?                     ((pin) + PIN_PD1) : NOT_A_PIN)
#endif
